feedback_questions = [
    (
        '<b>Чтобы в дальнейшем корректно сохранить документ, ответьте на два вопроса:</b>\n\n1) Введите год выполнения работы, например "2023":',
        'year'),
    ('2) Введите ваше ФИО на английском языке в формате "Ivanov_A_S":', 'second_name'),
    ('Введите номер группы, например "БПИ217":', 'group_number'),
    ('Введите ФИО исполнителя в родительном падеже, например "Иванова Ивана Ивановича":', 'student_name'),
    ('Введите название работы, например «Генератор документации "Радость Научника"»:', 'project_name'),
    (
        'Оцените по 10-балльной шкале четкость и корректность формулировки целей и задач проекта (функциональных и нефункциональных требований к проекту):',
        'grade_1'),
    (
        'Оцените по 10-балльной шкале полноту использования источников информации (книги, статьи, электронная библиотека НИУ ВШЭ, интернет-ресурсы и пр.), анализа аналогов:',
        'grade_2'),
    (
        'Оцените по 10-балльной шкале  сложность и/или объемность проведенного исследования, теоретической составляющей работы:',
        'grade_3'),
    (
        'Оцените по 10-балльной шкале сложность и/или объемность программной реализации, оригинальность и/или обоснованность предложенных технологических решений:',
        'grade_4'),
    ('Оцените по 10-балльной шкале достижение намеченной цели и выполнение поставленных задач проекта:', 'grade_5'),
    ('Оцените по 10-балльной шкале оформление программной документации по ГОСТ 19 ЕСПД:', 'grade_6'),
    ('Оцените по 10-балльной шкале Техническое задание (ГОСТ 19.201-7):', 'grade_7'),
    (
        'Оцените по 10-балльной шкале Пояснительную записку (полнота описания используемых математических методов, моделей, алгоритмов) (ГОСТ 19.404-79):',
        'grade_8'),
    ('Оцените по 10-балльной шкале Руководство оператора (ГОСТ 19.505-79) или Руководство программиста:', 'grade_9'),
    ('Оцените по 10-балльной шкале Программу и методику испытаний (ГОСТ 19.301-79):', 'grade_10'),
    (
        'Оцените по 10-балльной шкале оформление списка использованных источников / Наличие ссылок на источники в текстах:',
        'grade_11'),
    ('Укажите процент плагиата из системы Антиплагиат (не может превышать 40 % с учетом оформления по ГОСТ):',
     'percentage'),
    ('Напишите комменатрии к оценкам:', 'feedback'),
    ('Поставьте итоговую оценку, например "10 (ОТЛИЧНО)":', 'grade_itog'),
    ('Введите ФИО руководителя в формате "Фамилия И. О.":', 'supervisor_name'),
    ('Введите дату в формате "ДД.ММ.ГГГГ":', 'date')
]
