title_page_questions = [
    (
        '<b>Чтобы в дальнейшем корректно сохранить документ, ответьте на два вопроса:</b>\n\n1) Введите год выполнения работы, например "2023":',
        'year'),
    ('2) Введите ваше ФИО на английском языке в формате "Ivanov_A_S":', 'second_name'),
    ('Введите полное название ВУЗа, например "Национальный исследовательский университет Высшая Школа Экономики":',
     'university'),
    ('Введите факультет, например "Факультет компьютерных наук":', 'faculty'),
    ('Введите департамент, например "Департамент программной инженерии":', 'department'),
    ('Введите тип работы, например "Техническое задание":', 'project_type'),
    ('Введите название работы, например «Генератор документации "Радость Научника"»:', 'project_name'),
    (
        'Введите должность руководителя, согласовавшего документ, например "Научный руководитель, приглашенный преподаватель департамента программной инженерии":',
        'supervisor_post'),
    ('Введите ФИО руководителя, согласовавшего документ, в формате Фамилия И. О.:', 'supervisor_name'),
    (
        'Введите должность руководителя, утвердившего документ, например "Академический руководитель образовательной программы «Программная инженерия», кандидат технических наук":',
        'akad_post'),
    ('Введите ФИО руководителя, утвердившего документ, в формате Фамилия И. О.:', 'akad_name'),
    (
        'Введите номер работы:\n\nПодсказка: в соответствии с ГОСТ 19.103-77 "Обозначения программ и программных документов", номер имеет вид <b>A.B.XXXXX-XX</b>, где:\nA - Код страны; \nB - код организации-разработчика; \nXXXXX - регистрационный номер, который присваивается в соответствии с ОКП; \nXX - Номер редакции (в диапазоне 1-99).\n\nПодробнее можно прочитать по ссылке - https://www.swrit.ru/doc/espd/19.103-77.pdf:',
        'number'),
    ('Введите ФИО исполнителя в формате Фамилия И. О.:', 'student_name'),
    ('Введите номер группы, например "БПИ217":', 'group_number')
]
